In [31]:

import pandas as pd
data_df = pd.read_csv('FoodBalanceSheets_E_Africa_NOFLAG.csv', encoding = 'latin-1')

In [32]:
data_df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [33]:
data_df.groupby('Area')['Y2017'].sum().sort_values(ascending=False)

Area
Nigeria                        1483268.23
Egypt                           866379.92
South Africa                    517590.54
Ethiopia                        448683.76
Morocco                         388495.36
Ghana                           337599.06
Algeria                         325644.27
United Republic of Tanzania     322616.85
Kenya                           264660.66
Sudan                           239931.92
Cameroon                        232030.43
Angola                          229159.57
CÃ´te d'Ivoire                   224599.01
Uganda                          213950.38
Malawi                          181098.71
Mozambique                      161407.98
Mauritania                      156665.46
Mali                            149928.33
Madagascar                      131197.73
Niger                           126707.58
Benin                           124771.22
Tunisia                         124167.20
Zambia                          103223.77
Burkina Faso                    101855.07
Guinea                           98138.87
Senegal                          95681.15
Zimbabwe                         75919.34
Rwanda                           73663.69
Chad                             71594.68
Sierra Leone                     55311.33
Eswatini                         54343.33
Mauritius                        51114.83
Togo                             49841.88
Congo                            41181.68
Central African Republic         29937.00
Namibia                          29874.89
Liberia                          29342.20
Gabon                            27979.64
Gambia                           23154.18
Djibouti                         22729.91
Botswana                         22101.30
Lesotho                          21267.96
Guinea-Bissau                    19102.77
Cabo Verde                       14650.74
Sao Tome and Principe            12662.63
Seychelles                         442.34
Comoros                             59.84
Sudan (former)                       0.00
Ethiopia PDR                         0.00
Name: Y2017, dtype: float64

In [34]:
len(data_df.Area.unique())

49

In [35]:
data_df.groupby('Element')['Y2014','Y2015','Y2016','Y2017','Y2018'].sum().sort_values(ascending=False)

/tmp/ipykernel_23070/1192573425.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data_df.groupby('Element')['Y2014','Y2015','Y2016','Y2017','Y2018'].sum().sort_values(ascending=False)

TypeError: sort_values() missing 1 required positional argument: 'by'

In [36]:
data_df.shape

(60943, 12)

In [37]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

In [14]:
col = ['Age','Nationality','Overall']
df1 = pd.DataFrame(lst, columns= col, index=[1,2,3])

In [38]:
df1.head()

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [39]:
df2 = pd.DataFrame(lst, columns= col, index=[i for i in range (1,4)])

In [40]:
df2.head()

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [41]:
total = fuel_df.isnull().sum().sort_values(ascending=False)
percent_1 = fuel_df.isnull().sum()/fuel_df.isnull().count()*100
percent_2 = (round(percent_1, 3)).sort_values(ascending=False)
missing_data = pd.concat([total, percent_2], axis=1, keys=['Total', '%'])
missing_data.head()

       Total      %
Y2014   1589  2.607
Y2015   1548  2.540
Y2016   1535  2.519
Y2017   1506  2.471
Y2018   1436  2.356

In [42]:
fuel_df.groupby('Y2014')['Element'].sum()

Y2014
-1796.0                    Stock Variation
-1631.0                    Stock Variation
-849.0                  ResidualsResiduals
-838.0                     Stock Variation
-685.0                     Stock Variation
                         ...
 90425.0     Total Population - Both sexes
 98094.0     Total Population - Both sexes
 108756.0         Domestic supply quantity
 109593.0                       Production
 176405.0    Total Population - Both sexes
Name: Element, Length: 4493, dtype: object

In [44]:
data_df.groupby('Y2015')['Element'].sum()

Y2015
-3161.0                    Stock Variation
-2152.0                    Stock Variation
-1284.0                    Stock Variation
-907.0                     Stock Variation
-887.0                     Stock Variation
                         ...
 92443.0     Total Population - Both sexes
 100835.0    Total Population - Both sexes
 110798.0         Domestic supply quantity
 111663.0                       Production
 181137.0    Total Population - Both sexes
Name: Element, Length: 4520, dtype: object

In [28]:
data_df.groupby('Y2016')['Element'].sum()

Y2016
-3225.0                    Stock Variation
-2051.0                    Stock Variation
-1499.0                    Stock Variation
-1324.0                    Stock Variation
-1088.0                    Stock Variation
                         ...
 94447.0     Total Population - Both sexes
 103603.0    Total Population - Both sexes
 116483.0         Domestic supply quantity
 119330.0                       Production
 185960.0    Total Population - Both sexes
Name: Element, Length: 4520, dtype: object

In [29]:
data_df.groupby('Y2017')['Element'].sum()

Y2017
-1582.0      Stock VariationStock Variation
-1200.0                     Stock Variation
-1159.0                     Stock Variation
-865.0                      Stock Variation
-860.0                      Stock Variation
                          ...
 96443.0      Total Population - Both sexes
 106400.0     Total Population - Both sexes
 112625.0          Domestic supply quantity
 117702.0                        Production
 190873.0     Total Population - Both sexes
Name: Element, Length: 4537, dtype: object

In [46]:
data_df.groupby('Y2018')['Element'].sum()

Y2018
-3396.0                     Stock Variation
-2450.0                     Stock Variation
-2156.0      Stock VariationStock Variation
-1445.0                     Stock Variation
-1442.0                     Stock Variation
                          ...
 98424.0      Total Population - Both sexes
 109224.0     Total Population - Both sexes
 117038.0          Domestic supply quantity
 118172.0                        Production
 195875.0     Total Population - Both sexes
Name: Element, Length: 4591, dtype: object